Blog.org
#+Title: Blog
#+Author: Mario Román
#+Email: mromang08@gmail.com
#+Date: 26 December 2019
#+Creator: <a href="https://mroman42.github.com">@mroman42</a>.
#+Options: toc:nil date:t num:nil html-style:nil html-postamble:t
#+export_file_name: docs/blog.html

* TODO Cartesian closed categories                                                            :post:
:PROPERTIES:
:TITLE: Cartesian closed categories
:EXPORT_FILE_NAME: cartesianclosedcategories.html
:INDEX_DATE: <2018-07-01 Sun 11:30>
:ID:       3d52d110-822a-4f85-a1c4-57d868b527d5
:END:

A /cartesian closed category/ *C* can be defined as a category having a right adjoint
of the unique functor to the terminal category * : *C* -> 1, a right adjoint of the
diagonal functor  Δ : *C* -> *C* × *C*, and a right adjoint of (_ × c) : *C* -> *C* for
each c ∈ *C*. These three adjoints correspond to the existence of a /terminal/ object,
binary /products/ and /exponentials/.

#+BEGIN_SRC haskell
  * -> *     c,c ->  a,b      a × c -> b
 --------   --------------  --------------
  c -> 1     c  -> a × b     a -> (c -> b)
#+END_SRC

These three rules match the three introduction rules for the simply
typed lambda calculus. We interpret c as a context Γ and each morphism
x : c -> a as a term  Γ ⊢ x : a.

#+BEGIN_SRC haskell
                Γ ⊢ a : A   Γ ⊢ b : B     Γ , a : A ⊢ b : B
 -----------   ------------------------  ---------------------
  Γ ⊢ * : 1       Γ ⊢ ⟨a,b⟩ : A × B       Γ ⊢ (λa.b) : A -> B
#+END_SRC

Now, we should discuss if \beta-equivalence corresponds to the equality between morphisms.

