cartesianclosedcategories.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-06-24 Mon 12:02 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Cartesian closed categories</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mario Román" />
<link rel="stylesheet" href="default.css" />
<link rel="stylesheet" href="mathjax_fonts.css" />
<link rel="stylesheet" href="syntax.css" />
<div id="header">
<div id="logo">
<a hrwef="blog.html">Mario Román</a>
</div>
<div id="navigation">
<a href="about.html">About</a>
<a href="blog.html">Blog</a>
<a href="math.html">Math</a>
<a href="feed.xml">RSS</a>
</div>
</div>
</head>
<body>
<div id="content">
<h1 class="title">Cartesian closed categories</h1>
<p>
A <i>cartesian closed category</i> <b>C</b> can be defined as a category having a right adjoint
of the unique functor to the terminal category * : <b>C</b> -&gt; 1, a right adjoint of the
diagonal functor  Δ : <b>C</b> -&gt; <b>C</b> × <b>C</b>, and a right adjoint of (_ × c) : <b>C</b> -&gt; <b>C</b> for
each c ∈ <b>C</b>. These three adjoints correspond to the existence of a <i>terminal</i> object,
binary <i>products</i> and <i>exponentials</i>.
</p>

<div class="org-src-container">
<pre class="src src-haskell">  <span style="color: #7590db;">*</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #7590db;">*</span>     c,c <span style="color: #7590db;">-&gt;</span>  a,b      a <span style="color: #7590db;">&#215;</span> c <span style="color: #7590db;">-&gt;</span> b
 <span style="color: #3E8991; font-style: italic;">--</span><span style="color: #3E8991; font-style: italic;">------   --------------  --------------</span>
  c <span style="color: #7590db;">-&gt;</span> 1     c  <span style="color: #7590db;">-&gt;</span> a <span style="color: #7590db;">&#215;</span> b     a <span style="color: #7590db;">-&gt;</span> <span style="color: #4f97d7;">(</span>c <span style="color: #7590db;">-&gt;</span> b<span style="color: #4f97d7;">)</span>
</pre>
</div>

<p>
These three rules match the three introduction rules for the simply
typed lambda calculus. We interpret c as a context Γ and each morphism
x : c -&gt; a as a term  Γ ⊢ x : a.
</p>

<div class="org-src-container">
<pre class="src src-haskell">                <span style="color: #ce537a; font-weight: bold;">&#915;</span> <span style="color: #7590db;">&#8866;</span> a <span style="color: #ce537a; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">A</span>   <span style="color: #ce537a; font-weight: bold;">&#915;</span> <span style="color: #7590db;">&#8866;</span> b <span style="color: #ce537a; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">B</span>     <span style="color: #ce537a; font-weight: bold;">&#915;</span> , a <span style="color: #ce537a; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">&#8866;</span> b <span style="color: #ce537a; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">B</span>
 <span style="color: #3E8991; font-style: italic;">--</span><span style="color: #3E8991; font-style: italic;">---------   ------------------------  ---------------------</span>
  <span style="color: #ce537a; font-weight: bold;">&#915;</span> <span style="color: #7590db;">&#8866;</span> <span style="color: #7590db;">*</span> <span style="color: #ce537a; font-weight: bold;">:</span> 1       <span style="color: #ce537a; font-weight: bold;">&#915;</span> <span style="color: #7590db;">&#8866;</span> <span style="color: #4f97d7;">&#10216;</span>a,b<span style="color: #4f97d7;">&#10217;</span> <span style="color: #ce537a; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">&#215;</span> <span style="color: #ce537a; font-weight: bold;">B</span>       <span style="color: #ce537a; font-weight: bold;">&#915;</span> <span style="color: #7590db;">&#8866;</span> <span style="color: #4f97d7;">(</span>&#955;a<span style="color: #7590db;">.</span>b<span style="color: #4f97d7;">)</span> <span style="color: #ce537a; font-weight: bold;">:</span> <span style="color: #ce537a; font-weight: bold;">A</span> <span style="color: #7590db;">-&gt;</span> <span style="color: #ce537a; font-weight: bold;">B</span>
</pre>
</div>

<p>
Now, we should discuss if &beta;-equivalence corresponds to the equality between morphisms.
</p>
</div>
<div id="postamble" class="status">
<div id="footer"><p class="postamble">Last edited . Written by <a href="https://mroman42.github.com">@mroman42</a>.</p></div>
</div>
</body>
</html>
